Revit 2027 API
ParameterTypeId.StairstypeCalcRuleTargetResult Property
 "Target Result": Calculation Rule Target Result
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeCalcRuleTargetResult { get; }
Public Shared ReadOnly Property StairstypeCalcRuleTargetResult As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeCalcRuleTargetResult {
	ForgeTypeId^ get ();
}
static member StairstypeCalcRuleTargetResult : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace